#Requires AutoHotkey v2
/**
 * JSON ИСПОЛЬЗУЕТСЯ ИСКЛЮЧИТЕЛЬНО В ПРИМЕРАХ И В ОСНОВНОМ КОДЕ БИБЛИОТЕКИ
 * НЕ ЗАДЕЙСТВОВАН!
 */
#Include ../Lib/Json.ahk

/**
 * Подключаем библиотеку
 */
#Include ../Lib/NCLNameCaseRu.ahk

nc := NCLNameCaseRu()

/**
 * Указываем падеж русской константой
 */
OutputDebug((nc.q('Андрей Николаевич', NCL.RODITLN)) "`n")
; Андрея Николаевича

/**
 * Явно не указываем пол
 */
OutputDebug(JSON.stringify(nc.q('Иващук')) "`n")
; [
; 	"Иващук",
; 	"Иващук",
; 	"Иващук",
; 	"Иващук",
; 	"Иващук",
; 	"Иващук"
; ]

/**
 * Указываем мужской пол
 */
OutputDebug(JSON.stringify(nc.q('Иващук',, NCL.MAN)) "`n")
; [
; 	"Иващук",
; 	"Иващука",
; 	"Иващуку",
; 	"Иващука",
; 	"Иващуком",
; 	"Иващуке"
; ]
